Tekla.Structures.Geometry3d.Projection
The Projection class contains methods for calculating the projection of geometric objects on
other geometric objects.

Tekla.Structures.Geometry3d.Projection.PointToLine(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Line)
Returns a new point which is a projection of the given point onto the given line.
Point: The point to be used.
Line: The line to be used.
Returns: The new projection point.

Tekla.Structures.Geometry3d.Projection.PointToPlane(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new point which is a projection of the given point onto the given plane.
Point: The point to be used.
Plane: The plane to be used.
Returns: The new projection point.

Tekla.Structures.Geometry3d.Projection.LineToPlane(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new line which is a projection of the given line onto the given plane.
Line: The line to be used.
Plane: The plane to be used.
Returns: The new projection line.

Tekla.Structures.Geometry3d.Projection.LineSegmentToPlane(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new line segment which is a projection of the given line segment onto the given plane.
LineSegment: The line segment to be used.
Plane: The plane to be used.
Returns: The new projection line segment.